Revit 2015 API
ViewCropRegionShapeManager.SetCropRegionEmptyShape Method
 Sets crop region of empty shape making possible interactive sketching.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
public void SetCropRegionEmptyShape()
Visual Basic
Public Sub SetCropRegionEmptyShape
Visual C++
public:
void SetCropRegionEmptyShape()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  View is not allowed to manage crop region shape.
See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace